<?php

namespace Database\Seeders;

use App\Models\Government;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class GovernmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $governments=[
            [1, 'مصر', 'القاهرة', 'Cairo', '2023-09-04 02:25:43', '2023-09-04 02:25:43'],
            [2, 'مصر', 'الجيزة', 'Giza', '2023-09-04 02:25:43', '2023-09-04 02:25:43'],
            [3, 'مصر', 'الأسكندرية', 'Alexandria', '2023-09-04 02:25:43', '2023-09-04 02:25:43'],
            [4, 'مصر', 'الدقهلية', 'Dakahlia', '2023-09-04 02:25:43', '2023-09-04 02:25:43'],
            [5, 'مصر', 'البحر الأحمر', 'Red Sea', '2023-09-04 02:25:43', '2023-09-04 02:25:43'],
            [6, 'مصر', 'البحيرة', 'Beheira', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [7, 'مصر', 'الفيوم', 'Fayoum', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [8, 'مصر', 'الغربية', 'Gharbiya', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [9, 'مصر', 'الإسماعلية', 'Ismailia', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [10, 'مصر', 'المنوفية', 'Menofia', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [11, 'مصر', 'المنيا', 'Minya', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [12, 'مصر', 'القليوبية', 'Qaliubiya', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [13, 'مصر', 'الوادي الجديد', 'New Valley', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [14, 'مصر', 'السويس', 'Suez', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [15, 'مصر', 'اسوان', 'Aswan', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [16, 'مصر', 'اسيوط', 'Assiut', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [17, 'مصر', 'بني سويف', 'Beni Suef', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [18, 'مصر', 'بورسعيد', 'Port Said', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [19, 'مصر', 'دمياط', 'Damietta', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [20, 'مصر', 'الشرقية', 'Sharkia', '2023-09-04 02:25:44', '2023-09-04 02:25:44'],
            [21, 'مصر', 'جنوب سيناء', 'South Sinai', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [22, 'مصر', 'كفر الشيخ', 'Kafr Al sheikh', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [23, 'مصر', 'مطروح', 'Matrouh', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [24, 'مصر', 'الأقصر', 'Luxor', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [25, 'مصر', 'قنا', 'Qena', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [26, 'مصر', 'شمال سيناء', 'North Sinai', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [27, 'مصر', 'سوهاج', 'Sohag', '2023-09-04 02:25:45', '2023-09-04 02:25:45'],
            [28, 'مصر', 'سوهاج', 'Sohag', NULL, NULL],
            [29, 'مصر', 'شمال سيناء', 'North Sinai', NULL, NULL]
        ];

        foreach ($governments as $government) {
            Government::create([
                "country" => $government[1],
                "governorate_name_ar" => $government[2],
                "governorate_name_en" => $government[3]
            ]);
        }
    }
}
